sample/Dubbo Sampler.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <io.jmeter.plugins.dubbo.config.DubboConfig guiclass="io.jmeter.plugins.dubbo.gui.DubboConfigGui" testclass="io.jmeter.plugins.dubbo.config.DubboConfig" testname="test" enabled="true">
        <stringProp name="dubboObject">test</stringProp>
        <stringProp name="registry">zookeeper://127.0.0.1:2181</stringProp>
        <stringProp name="facade">org.apache.dubbo.samples.api.GreetingsService</stringProp>
        <intProp name="timeout">1000</intProp>
        <stringProp name="retries">2</stringProp>
        <stringProp name="connections">100</stringProp>
        <stringProp name="loadBalance">random</stringProp>
        <stringProp name="async">false</stringProp>
        <stringProp name="proxy">javassist</stringProp>
        <stringProp name="client">netty</stringProp>
        <stringProp name="actives">javax.swing.JTextField[,86,135,275x27,invalid,layout=javax.swing.plaf.basic.BasicTextUI$UpdateHandler,alignmentX=0.0,alignmentY=0.0,border=com.github.weisj.darklaf.components.border.MarginBorderWrapper$UIBorder@3aca823d,flags=296,maximumSize=,minimumSize=,preferredSize=,caretColor=UIColor[r=187, g=187,b=187],disabledTextColor=UIColor[r=119, g=119,b=119],editable=true,margin=javax.swing.plaf.InsetsUIResource[top=4,left=4,bottom=4,right=4],selectedTextColor=UIColor[r=221, g=221,b=221],selectionColor=UIColor[r=033, g=066,b=131],columns=0,columnWidth=0,command=,horizontalAlignment=LEADING]</stringProp>
        <stringProp name="cluster">failover</stringProp>
        <stringProp name="filter">default</stringProp>
        <stringProp name="listener">default</stringProp>
        <stringProp name="init">false</stringProp>
      </io.jmeter.plugins.dubbo.config.DubboConfig>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <stringProp name="LoopController.loops">10</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.delayedStart">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <io.jmeter.plugins.dubbo.sampler.DubboSampler guiclass="io.jmeter.plugins.dubbo.gui.DubboSamplerGui" testclass="io.jmeter.plugins.dubbo.sampler.DubboSampler" testname="Dubbo Sampler" enabled="true">
          <stringProp name="dubboObject">test</stringProp>
          <stringProp name="table">[
    {
        &quot;value&quot;: &quot;dubbo&quot;,
        &quot;type&quot;: &quot;java.lang.String&quot;
    }
]</stringProp>
          <stringProp name="method">sayHi</stringProp>
        </io.jmeter.plugins.dubbo.sampler.DubboSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>